layer {
        name: "Conv2d_transpose_16_weights"
        bottom: "Conv2d_transpose_15_BatchNorm"
        top: "Conv2d_transpose_16_weights"
        type: "Convolution"
        convolution_param {
        num_output: 3
        kernel_size: 4
        pad: 1
        stride: 1
        }
        
