layer {
        name: "Conv2d_transpose_8_weights"
        bottom: "Conv2d_transpose_7_BatchNorm"
        top: "Conv2d_transpose_8_weights"
        type: "Convolution"
        convolution_param {
        num_output: 64
        kernel_size: 4
        pad: 1
        stride: 2
        }
        
