layer {
        name: "Conv2d_transpose_6_weights"
        bottom: "Conv2d_transpose_5_BatchNorm"
        top: "Conv2d_transpose_6_weights"
        type: "Convolution"
        convolution_param {
        num_output: 128
        kernel_size: 4
        pad: 1
        stride: 1
        }
        
