layer {
        name: "Conv2d_transpose_7_BatchNorm"
        bottom: "Conv2d_transpose_7_weights"
        top: "Conv2d_transpose_7_weights"
        type: "BatchNorm"
        }
        layer {
        name: "Conv2d_transpose_7_BatchNorm"
        bottom: "Conv2d_transpose_7_weights"
        top: "Conv2d_transpose_7_weights"
        type: "Scale"
        scale_param {
        bias_term: true
        }
        
