layer {
        name: "Conv2d_transpose_2_weights"
        bottom: "Conv2d_transpose_1_BatchNorm"
        top: "Conv2d_transpose_2_weights"
        type: "Convolution"
        convolution_param {
        num_output: 256
        kernel_size: 4
        pad: 1
        stride: 2
        }
        
