layer {
        name: "Conv2d_transpose_4_weights"
        bottom: "Conv2d_transpose_3_BatchNorm"
        top: "Conv2d_transpose_4_weights"
        type: "Convolution"
        convolution_param {
        num_output: 256
        kernel_size: 4
        pad: 1
        stride: 1
        }
        
