layer {
        name: "Conv2d_transpose_1_weights"
        bottom: "resBlock_9_BatchNorm"
        top: "Conv2d_transpose_1_weights"
        type: "Convolution"
        convolution_param {
        num_output: 512
        kernel_size: 4
        pad: 1
        stride: 1
        }
        
