layer {
        name: "Conv2d_transpose_11_weights"
        bottom: "Conv2d_transpose_10_BatchNorm"
        top: "Conv2d_transpose_11_weights"
        type: "Convolution"
        convolution_param {
        num_output: 32
        kernel_size: 4
        pad: 1
        stride: 2
        }
        
