layer {
        name: "resBlock_1_Conv_weights"
        bottom: "resBlock_0_BatchNorm"
        top: "resBlock_1_Conv_weights"
        type: "Convolution"
        convolution_param {
        num_output: 16
        kernel_size: 1
        pad: 0
        stride: 1
        }
        
