layer {
        name: "resBlock_9_Conv_2"
        bottom: "resBlock_9_Conv_1_BatchNorm"
        top: "resBlock_9_Conv_2"
        type: "Convolution"
        convolution_param {
        num_output: 512
        kernel_size: 1
        pad: 0
        stride: 1
        }
        
