layer {
        name: "resBlock_8_Conv_BatchNorm"
        bottom: "resBlock_8_Conv_weights"
        top: "resBlock_8_Conv_weights"
        type: "BatchNorm"
        }
        layer {
        name: "resBlock_8_Conv_BatchNorm"
        bottom: "resBlock_8_Conv_weights"
        top: "resBlock_8_Conv_weights"
        type: "Scale"
        scale_param {
        bias_term: true
        }
        
