
        layer {
        name: "resBlock_4_eltwise"
        bottom: "resBlock_4_shortcut_weights"
        bottom: "resBlock_4_Conv_2"
        top: "resBlock_4_eltwise"
        type: "Eltwise"
        }
