layer {
        name: "resBlock_8_Conv_weights"
        bottom: "resBlock_7_BatchNorm"
        top: "resBlock_8_Conv_weights"
        type: "Convolution"
        convolution_param {
        num_output: 256
        kernel_size: 1
        pad: 0
        stride: 1
        }
        
