layer {
        name: "resBlock_5_Conv_weights"
        bottom: "resBlock_4_BatchNorm"
        top: "resBlock_5_Conv_weights"
        type: "Convolution"
        convolution_param {
        num_output: 64
        kernel_size: 1
        pad: 0
        stride: 1
        }
        
