layer {
        name: "resBlock_0_Conv_1"
        bottom: "resBlock_0_Conv_BatchNorm"
        top: "resBlock_0_Conv_1"
        type: "Convolution"
        convolution_param {
        num_output: 16
        kernel_size: 4
        pad: 1
        stride: 2
        }
        
