layer {
        name: "resBlock_4_shortcut_weights"
        bottom: "resBlock_3_BatchNorm"
        top: "resBlock_4_shortcut_weights"
        type: "Convolution"
        convolution_param {
        num_output: 128
        kernel_size: 1
        pad: 0
        stride: 2
        }
        
