layer {
        name: "resBlock_3_Conv_1"
        bottom: "resBlock_3_Conv_BatchNorm"
        top: "resBlock_3_Conv_1"
        type: "Convolution"
        convolution_param {
        num_output: 32
        kernel_size: 4
        pad: 1
        stride: 1
        }
        
