layer {
        name: "resBlock_6_Conv_weights"
        bottom: "resBlock_5_BatchNorm"
        top: "resBlock_6_Conv_weights"
        type: "Convolution"
        convolution_param {
        num_output: 128
        kernel_size: 1
        pad: 0
        stride: 1
        }
        
