layer {
        name: "resBlock_8_shortcut_weights"
        bottom: "resBlock_7_BatchNorm"
        top: "resBlock_8_shortcut_weights"
        type: "Convolution"
        convolution_param {
        num_output: 512
        kernel_size: 1
        pad: 0
        stride: 2
        }
        
