layer {
        name: "resBlock_2_shortcut_weights"
        bottom: "resBlock_1_BatchNorm"
        top: "resBlock_2_shortcut_weights"
        type: "Convolution"
        convolution_param {
        num_output: 64
        kernel_size: 1
        pad: 0
        stride: 2
        }
        
