
        layer {
        name: "resBlock_0_eltwise"
        bottom: "resBlock_0_shortcut_weights"
        bottom: "resBlock_0_Conv_2"
        top: "resBlock_0_eltwise"
        type: "Eltwise"
        }
