layer {
        name: "resBlock_9_Conv_1_BatchNorm"
        bottom: "resBlock_9_Conv_1"
        top: "resBlock_9_Conv_1"
        type: "BatchNorm"
        }
        layer {
        name: "resBlock_9_Conv_1_BatchNorm"
        bottom: "resBlock_9_Conv_1"
        top: "resBlock_9_Conv_1"
        type: "Scale"
        scale_param {
        bias_term: true
        }
        
